vmux0.0.11/ycsbVMs_ycsb_64vms_bridge_-1rps_rep1/vm31.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6385 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6385 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
2025-02-01 19:22:40:775 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2025-02-01 19:22:50:524 10 sec: 14415 operations; 1441.5 current ops/sec; est completion in 3 days 10 hours [READ: Count=7218, Max=82495, Min=116, Avg=644.06, 90=1111, 99=3915, 99.9=10391, 99.99=58815] [UPDATE: Count=7208, Max=24639, Min=110, Avg=662.53, 90=1167, 99=4343, 99.9=9983, 99.99=15823] 
2025-02-01 19:23:00:521 20 sec: 31987 operations; 1757.2 current ops/sec; est completion in 3 days 2 hours [READ: Count=8742, Max=10639, Min=109, Avg=563.93, 90=949, 99=2467, 99.9=5235, 99.99=10167] [UPDATE: Count=8820, Max=21983, Min=104, Avg=561.82, 90=935, 99=2625, 99.9=5311, 99.99=17839] 
2025-02-01 19:23:10:521 30 sec: 52659 operations; 2067.2 current ops/sec; est completion in 2 days 19 hours [READ: Count=10428, Max=21423, Min=137, Avg=481.69, 90=722, 99=1224, 99.9=4359, 99.99=13407] [UPDATE: Count=10243, Max=12375, Min=128, Avg=475.1, 90=716, 99=1205, 99.9=4179, 99.99=7279] 
2025-02-01 19:23:20:521 40 sec: 74012 operations; 2135.3 current ops/sec; est completion in 2 days 16 hours [READ: Count=10706, Max=13271, Min=139, Avg=465.47, 90=710, 99=1297, 99.9=4211, 99.99=11015] [UPDATE: Count=10656, Max=7743, Min=138, Avg=463.29, 90=705, 99=1292, 99.9=4195, 99.99=5427] 
2025-02-01 19:23:30:521 50 sec: 90173 operations; 1616.1 current ops/sec; est completion in 2 days 18 hours [READ: Count=8033, Max=15679, Min=149, Avg=609.72, 90=968, 99=2113, 99.9=5091, 99.99=14319] [UPDATE: Count=8121, Max=18975, Min=138, Avg=622.06, 90=1003, 99=2247, 99.9=5827, 99.99=17631] 
2025-02-01 19:23:40:521 60 sec: 113001 operations; 2282.8 current ops/sec; est completion in 2 days 15 hours [READ: Count=11325, Max=6455, Min=103, Avg=433.14, 90=694, 99=1226, 99.9=3403, 99.99=5007] [UPDATE: Count=11505, Max=10831, Min=102, Avg=436.45, 90=702, 99=1273, 99.9=2915, 99.99=6011] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2025-02-01 19:23:41:531 61 sec: 116284 operations; 3250.5 current ops/sec; est completion in 2 days 14 hours [READ: Count=1591, Max=2225, Min=101, Avg=301.25, 90=440, 99=667, 99.9=1755, 99.99=2225] [CLEANUP: Count=1, Max=2503, Min=2502, Avg=2503, 90=2503, 99=2503, 99.9=2503, 99.99=2503] [UPDATE: Count=1688, Max=6179, Min=102, Avg=306.29, 90=448, 99=667, 99.9=2841, 99.99=6179] 
[OVERALL], RunTime(ms), 61010
[OVERALL], Throughput(ops/sec), 1905.9826257990494
[TOTAL_GCS_G1_Young_Generation], Count, 6
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 108
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.177020160629405
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 6
[TOTAL_GC_TIME], Time(ms), 108
[TOTAL_GC_TIME_%], Time(%), 0.177020160629405
[READ], Operations, 58043
[READ], AverageLatency(us), 514.5778991437383
[READ], MinLatency(us), 101
[READ], MaxLatency(us), 82495
[READ], 95thPercentileLatency(us), 1021
[READ], 99thPercentileLatency(us), 2022
[READ], Return=OK, 58043
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2503.0
[CLEANUP], MinLatency(us), 2502
[CLEANUP], MaxLatency(us), 2503
[CLEANUP], 95thPercentileLatency(us), 2503
[CLEANUP], 99thPercentileLatency(us), 2503
[UPDATE], Operations, 58241
[UPDATE], AverageLatency(us), 517.2336498343092
[UPDATE], MinLatency(us), 102
[UPDATE], MaxLatency(us), 24639
[UPDATE], 95thPercentileLatency(us), 1045
[UPDATE], 99thPercentileLatency(us), 2159
[UPDATE], Return=OK, 58241
AUTOTEST_DONE